{
  "yoga": {
    "हठ": {
      "description": "हठ योग सूर्य (ह) और चंद्रमा (त) के बीच संतुलन लाने की प्रक्रिया है। यह शरीर को उच्च संभावनाओं के लिए तैयार करता है। आपकी मुद्रा आपकी मानसिक स्थिति को दर्शाती है। विभिन्न मुद्राएँ अपनाकर, आप अपनी चेतना को ऊपर उठा सकते हैं।",
       "steps": "1. पर्वतासन (ताड़ासन) में खड़े होकर शुरू करें, पैरों को साथ में रखें।\n2. श्वास लें, हाथों को ऊपर उठाएं, और धीरे से पीछे की ओर झुकें।\n3. श्वास छोड़ें, और आगे झुकें और उत्तानासन में जाएं।\n4. दाहिने पैर को पीछे ले जाकर अंजनेयासन में आएं।\n5. अधोमुख श्वानासन में आएं।\n6. दूसरी तरफ स्विच करते हुए अनुक्रम को दोहराएं।\n7. शवासन के साथ समाप्त करें।",
      "videoUrl": "https://yoga-videos.com/hatha"
    },
    "विन्यास": {
      "description": "विन्यास योग एक गतिशील शैली है जिसमें आसनों का प्रवाह होता है। यह शरीर को मजबूत और लचीला बनाने में मदद करता है।",
      "steps": "1. अधोमुख श्वानासन से शुरू करें।\n2. श्वास लें, और फलकासन में आगे बढ़ें।\n3. श्वास छोड़ें, चतुरंग दंडासन में आएं।\n4. श्वास लें, और ऊर्ध्वमुख श्वानासन में उठें।\n5. श्वास छोड़ें, और अधोमुख श्वानासन में वापस आएं।\n6. इस अनुक्रम को श्वास के साथ प्रवाहित करें।\n7. बालासन में विश्राम करें।",
      "videoUrl": "https://yoga-videos.com/vinyasa"
    },
    "अस्थांग": {
      "description": "अस्थांग योग एक कठिन शैली है जिसमें एक विशिष्ट आसनों के अनुक्रम का पालन किया जाता है। यह शक्ति, लचीलापन और संतुलन को विकसित करता है।",
       "steps": "1. सूर्य नमस्कार ए से शुरू करें, पाँच बार करें।\n2. सूर्य नमस्कार बी को पाँच बार करें।\n3. योद्धा I, योद्धा II, त्रिकोणासन जैसे खड़े अनुक्रमों में आगे बढ़ें।\n4. बैठी मुद्रा में आगे बढ़ें जैसे पश्चिमोत्तानासन और मरिच्यासन।\n5. अंत में कंधरासन, शीर्षासन और पद्मासन का अभ्यास करें।\n6. शवासन में विश्राम के साथ समाप्त करें।",
      "videoUrl": "https://yoga-videos.com/ashtanga"
    },
    "यिन": {
      "description": "यिन योग एक धीमी गति की शैली है जिसमें आसनों को लंबे समय तक रखा जाता है। यह गहरी खिंचाव और मानसिक शांति का अनुभव कराता है।",
      "steps": "1. बटरफ्लाई पोज़ में शुरू करें, 3-5 मिनट तक रहें।\n2. पश्चिमोत्तानासन में जाएं, 3-5 मिनट तक रुकें।\n3. ड्रैगन पोज़ में जाएं, प्रत्येक तरफ 3-5 मिनट तक रहें।\n4. सुप्त मत्स्येन्द्रासन में जाएं, प्रत्येक तरफ 3-5 मिनट तक रुकें।\n5. शवासन में समाप्त करें, गहरी सांसों पर ध्यान केंद्रित करें।",
      "videoUrl": "https://yoga-videos.com/yin"
   
    },
    "विश्राम": {
      "description": "विश्राम योग तनाव और चिंता को कम करने के लिए केंद्रित होता है। यह शारीरिक और मानसिक विश्राम के लिए आदर्श है।",
       "steps": "1. बालासन में एक तकिया या बॉलस्टर के साथ शुरू करें।\n2. समर्थित सेतु बंधासन में आएं।\n3. सुप्त बद्ध कोणासन में जाएं।\n4. पैरों को दीवार के खिलाफ उठाकर विपरीत करनी मुद्रा में आएं।\n5. शवासन में समाप्त करें, धीरे-धीरे और गहरी सांसों पर ध्यान दें।",
      "videoUrl": "https://yoga-videos.com/restorative"
    }
  }
}
