export const localisedStrings = {
  welcomeMessage: '**नमस्ते! आपके योग और ध्यान सहायक में आपका स्वागत है।**',
  languageChangedMessage: '**आपने सफलतापूर्वक अपनी भाषा हिंदी में बदल ली है।**',
  guide: "**मैं यहां आपकी आवश्यकताओं के अनुसार योग अभ्यास और ध्यान तकनीकों में आपका मार्गदर्शन करने के लिए हूं।**",
  guidebutton:["योग अभ्यास","ध्यान तकनीकें","व्यक्तिगत सिफारिशें","युक्तियाँ और संसाधन",],
  language_english: 'English',
  language_hindi: 'हिन्दी',
  poseMessage: 'कृपया निम्नलिखित विकल्पों में से योग का एक प्रकार चुनें:',
  poseButtons: ['हठ','विन्यास','अस्थांग','यिन','विश्राम'],
  moreDetails: "योग करने के लिए अधिक विवरण",
  mainMenuHindi: "मुख्य मेनू",

        
};
